; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	thermograph5 - mode
	spectrograph2 - mode
	image4 - mode
	spectrograph3 - mode
	infrared1 - mode
	spectrograph0 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation3 - direction
	Star10 - direction
	Star11 - direction
	GroundStation2 - direction
	GroundStation7 - direction
	Star8 - direction
	Star6 - direction
	GroundStation5 - direction
	GroundStation4 - direction
	Star9 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
	Star16 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 spectrograph3)
	(supports instrument0 image4)
	(calibration_target instrument0 Star8)
	(calibration_target instrument0 GroundStation7)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph5)
	(supports instrument1 spectrograph0)
	(supports instrument1 infrared1)
	(calibration_target instrument1 Star9)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation5)
	(calibration_target instrument1 Star6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star6)
)
(:goal (and
	(have_image Phenomenon12 spectrograph0)
	(have_image Phenomenon13 infrared1)
	(have_image Star14 spectrograph2)
	(have_image Star15 thermograph5)
	(have_image Star16 spectrograph0)
	(have_image Star16 thermograph5)
))

)

; plan
1. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 6
2. (calibrate satellite0 instrument1 star6)
   added: (calibrated instrument1)
   goals met: 0 of 6
3. (turn_to satellite0 star15 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 star15)
   goals met: 0 of 6
4. (take_image satellite0 star15 instrument1 thermograph5)
   added: (have_image star15 thermograph5)
   goals met: 1 of 6
5. (turn_to satellite0 phenomenon13 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 phenomenon13)
   goals met: 1 of 6
6. (take_image satellite0 phenomenon13 instrument1 infrared1)
   added: (have_image phenomenon13 infrared1)
   goals met: 2 of 6
7. (turn_to satellite0 phenomenon12 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 phenomenon12)
   goals met: 2 of 6
8. (take_image satellite0 phenomenon12 instrument1 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 3 of 6
9. (turn_to satellite0 star16 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star16)
   goals met: 3 of 6
10. (take_image satellite0 star16 instrument1 spectrograph0)
   added: (have_image star16 spectrograph0)
   goals met: 4 of 6
11. (take_image satellite0 star16 instrument1 thermograph5)
   added: (have_image star16 thermograph5)
   goals met: 5 of 6
12. (switch_off instrument1 satellite0)
   deleted: (power_on instrument1)
   added: (power_avail satellite0)
   goals met: 5 of 6
13. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 5 of 6
14. (turn_to satellite0 groundstation2 star16)
   deleted: (pointing satellite0 star16)
   added: (pointing satellite0 groundstation2)
   goals met: 5 of 6
15. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 5 of 6
16. (turn_to satellite0 star14 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star14)
   goals met: 5 of 6
17. (take_image satellite0 star14 instrument0 spectrograph2)
   added: (have_image star14 spectrograph2)
   goals met: 6 of 6
